W6D5/nn_cats/app/controllers/cats_controller.rb

  def index
    @kitties = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    @kitty = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]